"""Створіть масив зі строками, які будуть складатися з чисел, які розділені комою. Наприклад:

["1,2,3,4",
"1,2,3,4,50"
"qwerty1,2,3"]

Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).

Якщо є символи, що не є числами (”qwerty1,2,3” у прикладі), вам потрібно зловити вийняток і вивести “Не можу це зробити!”

Використовуйте блок try\except, щоб уникнути інших символів, окрім чисел у списку.

Для цього прикладу правильний вивід буде - 10, 60, “Не можу це зробити”"""

array_of_strings = [
    "1,2,3,4",
    "1,2,3,4,50",
    "qwerty1,2,3"
]

def sum_numbers(item):
    try:
        numbers = map(int, item.split(','))
        total = sum(numbers)
        return total
    except ValueError:
        return "Не можу це зробити!"

for string in array_of_strings:
    print(sum_numbers(string))